app/Controllers/Admin.php

    public function dashboard(){

        $nasabah = new M_nasabah();
        $sampahMasuk= new M_sampah_masuk();
        $setoran= new M_setoran();
        $penarikan= new M_penarikan();
        $konten = new M_konten_publikasi();
        $riwayat = new M_riwayat_transaksi();
        $sampahTerkelola = new M_kelola_sampah();



        $dataChartSampah = $sampahTerkelola->getDataPerDate();
        $dataKumulatifChartSampah = $sampahTerkelola->getDataKumulatifPerDate();


        $timbulan = $sampahMasuk ->getTimbulan();

        $dataKelola = $sampahTerkelola ->getTotalTerkelola();
        $dataTerkelola = $dataKelola["terkelola"];
        $dataTidakTerkelola = $dataKelola["tidakTerkelola"];

        $dataChart = $riwayat->getRiwayatByDate();

        $totalSetoran = $setoran->countAllResults();
        $totalPenarikan = $penarikan->countAllResults();
        $totalKonten = $konten->countAllResults();
        $totalNasabah = $nasabah->countAllResults();

        $dataRiwayat = $riwayat->orderBy('tanggal','DESC')->paginate(20);
---
SELECT COUNT(*) AS `numrows`
FROM `setoran`
SELECT COUNT(*) AS `numrows`
FROM `penarikan`
SELECT COUNT(*) AS `numrows`
FROM `konten_publikasi`
SELECT COUNT(*) AS `numrows`
FROM `nasabah`
SELECT *
FROM `riwayat_transaksi`
ORDER BY `tanggal` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `riwayat_transaksi`

    public function riwayatSetoran(){


        $setoran= new M_setoran();
        $penarikan= new M_penarikan();


        $totalSetoran = $setoran->countAllResults();
        $totalPenarikan = $penarikan->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `setoran`
SELECT COUNT(*) AS `numrows`
FROM `penarikan`

    public function riwayatPenarikan(){


        $setoran= new M_setoran();
        $penarikan= new M_penarikan();

        $totalSetoran = $setoran->countAllResults();
        $totalPenarikan = $penarikan->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `setoran`
SELECT COUNT(*) AS `numrows`
FROM `penarikan`

    public function tabungan(){

        $sampah = new M_sampah();
        $dataSampah = $sampah->findAll();
---
SELECT *
FROM `sampah`