app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `konten`
SELECT *
FROM `riwayat_transaksi`
ORDER BY `tanggal` DESC
 LIMIT 10
---
    public function dashboard()
    {

        $nasabah = new M_nasabah();
        $sampahMasuk= new M_sampah_masuk();
        $setoran= new M_setoran();
        $penarikan= new M_penarikan();
        $konten = new M_konten();
        $riwayat = new M_riwayat_transaksi();



        $timbulan = $sampahMasuk ->getTimbulan();

        $dataChart = $riwayat->getRiwayatByDate();

        $timbulan = $sampahMasuk->getTimbulan();

        $totalSetoran = $setoran->countAllResults();
        $totalPenarikan = $penarikan->countAllResults();
        $totalKonten = $konten->countAllResults();
        $totalNasabah = $nasabah->countAllResults();

        $dataRiwayat = $riwayat->orderBy('tanggal','DESC')->paginate(10);