app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `konten_kegiatan`
---
    public function dashboard(){

        $nasabah = new M_nasabah();
        $sampahMasuk= new M_sampah_masuk();
        $setoran= new M_setoran();
        $penarikan= new M_penarikan();
        $kegiatan = new M_konten_kegiatan();
        $konten = new M_konten_publikasi();
        $riwayat = new M_riwayat_transaksi();
        $sampahTerkelola = new M_kelola_sampah();



        $dataChartSampah = $sampahTerkelola->getDataPerDate();

        $dataKumulatifChartSampah = $sampahTerkelola->getDataKumulatifPerDate();
        // dd($dataChartSampah);


        $timbulan = $sampahMasuk ->getTimbulan();

        $dataKelola = $sampahTerkelola ->getTotalTerkelola();
        $dataTerkelola = $dataKelola["terkelola"];
        $dataTidakTerkelola = $dataKelola["tidakTerkelola"];

        $dataChart = $riwayat->getRiwayatByDate();

        $totalSetoran = $setoran->countAllResults();
        $totalPenarikan = $penarikan->countAllResults();
        $totalKegiatan = $kegiatan->countAllResults();