app/Controllers/DaftarLimbah.php

    public function deleteDaftarLimbah($id)
    {
       $daftarLimbah = new M_daftar_limbah();

       $daftarLimbah->delete($id);
---
DELETE FROM `daftar_limbah`
WHERE `id` IN ('8')