app/Controllers/DataSampah.php

    public function tambahDataSampah()
    {
        $sampahMasuk = new M_sampah_masuk();

        $tanggalMasuk = $this->request->getVar('tanggal_masuk');
        $totalBerat = $this->request->getVar('total_berat');

        $sampahMasuk->insert([
            'tanggal_masuk' => $tanggalMasuk,
            'total_berat' => $totalBerat,
            'status' => 'Belum Terkelola',
        ]);
---
INSERT INTO `sampah_masuk` (`tanggal_masuk`, `total_berat`, `status`) VALUES ('2023-08-19', '20', 'Belum Terkelola')