app/Controllers/Home.php

SELECT *
FROM `profil`
---
    public function about()
    {
        $profil = new M_profil();
        $dataProfil = $profil->findAll();

SELECT *
FROM `profil`
---
    public function saldo()
    {
        $header['title']='Cek Saldo';
        $profil = new M_profil();
        $dataProfil = $profil->findAll();