app/Controllers/Login.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function process (){
        $users = new \App\Models\M_admin();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([
            'username' => $username,
        ])->first();