app/Controllers/Produk.php

            'nominal_penjualan' => $keuntungan,
        ]);

        $penjualanProduk->insert([
            'daftar_produk_id' => $oldData["daftar_produk_id"],
            'admin_id' => $admin,
            'tanggal' => $tanggal,
            'total_terjual' => $terjual,
            'nominal_penjualan' => $pendapatan,
            'image_bukti' => $imageName,
        ]);
---
INSERT INTO `penjualan_produk` (`daftar_produk_id`, `admin_id`, `tanggal`, `total_terjual`, `nominal_penjualan`, `image_bukti`) VALUES ('1', '3', '2024-03-03 04:28:38pm', '4', 40000, '1709458118_e527aa775f6613929157.jpeg')