app/Controllers/Tabungan.php

SELECT `id`
FROM `nasabah`
WHERE `no_tabungan` = '1'
 LIMIT 1
---
    public function tambahSetoran()
    {
        $nasabah = new M_nasabah();
        $tabungan = new M_tabungan();
        $setoran = new M_setoran();
        $sampah = new M_sampah();
        $riwayat = new M_riwayat_transaksi();

        $admin = session('id');

        $nomor = $this->request->getPost('nomor');

        $file = $this->request->getFile('imageSetoran');
        if($file->isValid() && !$file->hasMoved()){
            $imageName = $file->getRandomName();
            $file->move('uploads/buktiSetoran/',$imageName);
        }

        $id = $nasabah->select('id')->where('no_tabungan',$nomor)->first();

INSERT INTO `setoran` (`id_transaksi`, `tanggal`, `nasabah_id`, `admin_id`, `image_bukti`, `total_berat`, `total_harga`, `sampah_id`) VALUES ('65e3fd07cd09a', '2024/03/03', '1', '3', '1709440263_74daa5bbd1fa8290ef13.jpeg', '12', 12000, '2')
---
            $data['total_harga'] = $harga;
            $data['sampah_id'] = $idSampah;

            $setoran->insert($data);

UPDATE `tabungan` SET `saldo` = 14000, `debit` = 24000
WHERE `tabungan`.`id` IN ('1')
---
            'debit' => $debitBaru,
        ];

        $tabungan->update($dataTabungan['id'],$data2);

SELECT `id`
FROM `nasabah`
WHERE `no_tabungan` = '1'
 LIMIT 1
SELECT *
FROM `tabungan`
WHERE `nasabah_id` = '1'
 LIMIT 1
---
    public function tambahPenarikan()
    {
        $nasabah = new M_nasabah();
        $tabungan = new M_tabungan();
        $penarikan = new M_penarikan();
        $riwayat = new M_riwayat_transaksi();

        $admin = session('id');

        $nomor = $this->request->getPost('nomor');

        $file = $this->request->getFile('imagePenarikan');
        if($file->isValid() && !$file->hasMoved()){
            $imageName = $file->getRandomName();
            $file->move('uploads/buktiPenarikan/',$imageName);
        }

        $id = $nasabah->select('id')->where('no_tabungan',$nomor)->first();

        $totalPenarikan = $this->request->getPost('saldo');
        $tanggal = date("Y/m/d");



//tabungan
        $dataTabungan = $tabungan->where('nasabah_id',$id['id'])->first();

UPDATE `tabungan` SET `saldo` = 2000, `kredit` = 10000
WHERE `tabungan`.`id` IN ('1')
INSERT INTO `penarikan` (`tanggal`, `nasabah_id`, `admin_id`, `total_penarikan`, `image_bukti`) VALUES ('2024/03/03', '1', '3', '10000', '1709440235_b2091ffe60adca446042.jpg')
---
            'kredit' => $SaldoPenarikan,
        ];

        $tabungan->update($dataTabungan['id'],$data2);

//penarikan
        $penarikan->insert([
            'tanggal' => $tanggal,
            'nasabah_id' => $id['id'],
            'admin_id' => $admin,
            'total_penarikan' => $totalPenarikan,
            'image_bukti' => $imageName,
        ]);