app/Controllers/Tabungan.php

    public function tambahPenarikan()
    {
        $nasabah = new M_nasabah();
        $tabungan = new M_tabungan();
        $penarikan = new M_penarikan();
        $riwayat = new M_riwayat_transaksi();

        $admin = session('id');

        $nomor = $this->request->getPost('nomor');

        $id = $nasabah->select('id')->where('no_tabungan',$nomor)->first();

        $totalPenarikan = $this->request->getPost('saldo');
        $tanggal = date("Y/m/d");



//tabungan
        $dataTabungan = $tabungan->where('nasabah_id',$id['id'])->first();
---
SELECT *
FROM `tabungan`
WHERE `nasabah_id` = '1'
 LIMIT 1