app/Models/M_daftar_limbah.php

SELECT *
FROM `daftar_limbah`
ORDER BY `tanggal_update` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `daftar_limbah`
---
    function getPaginated($num,$keyword = null,$startDate=null,$endDate=null){
        $builder = $this->table('daftar_limbah');

        if($keyword != ''){
            $builder->like('jenis_limbah',$keyword)->orLike('harga',$keyword);
        }

        if ($startDate != "" && $endDate != ""){
            $builder->where('tanggal_update >=', $startDate)->where('tanggal_update <=', $endDate);
        }

        return [
            'data' => $this->orderBy('tanggal_update','DESC')->paginate($num),
            'pager' => $this->pager,
        ];