app/Models/M_gallery_kegiatan.php

SELECT *
FROM `gallery_kegiatan`
WHERE `konten_kegiatan_id` = '10'
---
    function getGallery($id){
        $builder = $this->table('gallery_kegiatan');
        $data = $builder->where('konten_kegiatan_id',$id)->findAll();