app/Models/M_kelola_sampah.php

    function getTotalTerkelola(){
        $builder = $this->table('kelola_sampah');

        $data = $builder->select('SUM(terkelola) as total_terkelola, SUM(tidak_terkelola) as total_tidak_terkelola')->findAll();
---
SELECT SUM(terkelola) as total_terkelola, SUM(tidak_terkelola) as total_tidak_terkelola
FROM `kelola_sampah`

    function getDataPerDate(){
        $builder = $this->table('kelola_sampah');


        $years = [];
        $lastYear = '';
        $sampahMasukChart = [];
        $tidakTerkelolaChart = [];
        $komposChart = [];
        $maggotChart = [];

        $chartData = $builder->select('YEAR(kelola_sampah.tanggal_update) AS year, MONTH(kelola_sampah.tanggal_update) AS month,SUM(sampah_masuk.total_berat) AS totalMasuk, SUM(kelola_sampah.berat_kompos) AS totalKompos, SUM(kelola_sampah.berat_maggot) AS totalMaggot, SUM(kelola_sampah.tidak_terkelola) AS totalSisa')
        ->join('sampah_masuk' ,'kelola_sampah.sampah_masuk_id=sampah_masuk.id')
        ->groupBy('YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update)')->findAll();
---
SELECT YEAR(kelola_sampah.tanggal_update) AS year, MONTH(kelola_sampah.tanggal_update) AS month, SUM(sampah_masuk.total_berat) AS totalMasuk, SUM(kelola_sampah.berat_kompos) AS totalKompos, SUM(kelola_sampah.berat_maggot) AS totalMaggot, SUM(kelola_sampah.tidak_terkelola) AS totalSisa
FROM `kelola_sampah`
JOIN `sampah_masuk` ON `kelola_sampah`.`sampah_masuk_id`=`sampah_masuk`.`id`
GROUP BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update)

    function getDataKumulatifPerDate(){
        $builder = $this->table('kelola_sampah');


        $years = [];
        $lastYear = '';
        $sampahMasukChart = [];
        $tidakTerkelolaChart = [];
        $komposChart = [];
        $maggotChart = [];

        $chartData = $builder->select('YEAR(kelola_sampah.tanggal_update) AS year, MONTH(kelola_sampah.tanggal_update) AS month,SUM(sampah_masuk.total_berat) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalMasuk, SUM(kelola_sampah.berat_kompos) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalKompos, SUM(kelola_sampah.berat_maggot) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalMaggot, SUM(kelola_sampah.tidak_terkelola) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalSisa')
        ->join('sampah_masuk' ,'kelola_sampah.sampah_masuk_id=sampah_masuk.id')
        ->groupBy('YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update)')->findAll();
---
SELECT YEAR(kelola_sampah.tanggal_update) AS year, MONTH(kelola_sampah.tanggal_update) AS month, SUM(sampah_masuk.total_berat) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalMasuk, SUM(kelola_sampah.berat_kompos) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalKompos, SUM(kelola_sampah.berat_maggot) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalMaggot, SUM(kelola_sampah.tidak_terkelola) OVER (ORDER BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update))  AS totalSisa
FROM `kelola_sampah`
JOIN `sampah_masuk` ON `kelola_sampah`.`sampah_masuk_id`=`sampah_masuk`.`id`
GROUP BY YEAR(kelola_sampah.tanggal_update), MONTH(kelola_sampah.tanggal_update)