app/Models/M_konten_kegiatan.php

    function getDataWithLimit($limit){
        $builder = $this->table('konten_kegiatan');
        $data = $builder->limit($limit)->orderBy('tanggal')->find();
---
SELECT *
FROM `konten_kegiatan`
ORDER BY `tanggal`
 LIMIT 4

    function getDataWithPage($num){
        $builder = $this->table('konten_kegiatan');

        $data =  $builder->orderBy('tanggal')->paginate($num);
---
SELECT *
FROM `konten_kegiatan`
ORDER BY `tanggal`
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `konten_kegiatan`

    function getData($slug){
        $builder = $this->table('konten_kegiatan');
        $data = $builder->where('slug',$slug)->select('konten_kegiatan.id, konten_kegiatan.tanggal, konten_kegiatan.judul, konten_kegiatan.slug, konten_kegiatan.isi, konten_kegiatan.thumbnail, konten_kegiatan.views, admin.nama')
        ->join('admin','konten_kegiatan.admin_id=admin.id')->first();
---
SELECT `konten_kegiatan`.`id`, `konten_kegiatan`.`tanggal`, `konten_kegiatan`.`judul`, `konten_kegiatan`.`slug`, `konten_kegiatan`.`isi`, `konten_kegiatan`.`thumbnail`, `konten_kegiatan`.`views`, `admin`.`nama`
FROM `konten_kegiatan`
JOIN `admin` ON `konten_kegiatan`.`admin_id`=`admin`.`id`
WHERE `slug` = '3-cara-mengelola-bank-sampah-dengan-benar'
 LIMIT 1

    public function incrementCount($slug)
    {
        $builder = $this->table('konten_kegiatan');

        $builder->where('slug',$slug)->set('views', 'views + 1', false)
             ->update();
---
UPDATE `konten_kegiatan` SET `views` = views + 1
WHERE `slug` = '3-cara-mengelola-bank-sampah-dengan-benar'