app/Models/M_media_ig.php

SELECT *
FROM `media_ig`
---
    function getAllPost(){

        $builder = $this->table('media_ig');

        return $builder->findAll();

SELECT COUNT(*) AS `numrows`
FROM `media_ig`
---
    function totalPost(){
        $builder = $this->table('media_ig');

        return $builder->countAllResults();

SELECT `tanggal`
FROM `media_ig`
ORDER BY `tanggal` DESC
 LIMIT 1
---
    function getDatePost(){
        $builder = $this->table('media_ig');

        return $builder->select('tanggal')->orderBy('tanggal','DESC')->first();