app/Models/M_nasabah.php

    function getPaginated($num,$keyword = null){
        $builder = $this->table('nasabah');

        if($keyword != ''){
            $builder->like('nama',$keyword)->orLike('alamat',$keyword);
        }

        return [
            'data' => $this->paginate($num),
            'pager' => $this->pager,
        ];
---
SELECT *
FROM `nasabah`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `nasabah`

    function searchByKode($id){
        $builder = $this->table('nasabah');
        return $builder->where('kode', $id)->findAll();
---
SELECT *
FROM `nasabah`
WHERE `kode` = '23124'

    function getTotalNasabah(){
        $builder = $this->table('nasabah');
        return $builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `nasabah`