app/Models/M_penarikan.php

SELECT COUNT(*) AS `numrows`
FROM `penarikan`
JOIN `nasabah` ON `penarikan`.`nasabah_id`=`nasabah`.`id`
JOIN `admin` ON `penarikan`.`admin_id`=`admin`.`id`
SELECT `penarikan`.`id`, `penarikan`.`tanggal`, `nasabah`.`no_tabungan`, `admin`.`nama`, `penarikan`.`total_penarikan`, `penarikan`.`image_bukti`
FROM `penarikan`
JOIN `nasabah` ON `penarikan`.`nasabah_id`=`nasabah`.`id`
JOIN `admin` ON `penarikan`.`admin_id`=`admin`.`id`
ORDER BY `penarikan`.`tanggal` DESC
 LIMIT 10
---
    function getPaginated($num,$keyword = null,$startDate=null,$endDate=null){
        $builder = $this->table('penarikan');

        if($keyword != ''){
            $builder->like('nasabah.no_tabungan',$keyword);
        }

        if ($startDate != "" && $endDate != ""){
            $builder->where('penarikan.tanggal >=', $startDate)->where('penarikan.tanggal <=', $endDate);
        }

        $data = $builder->select('penarikan.id, penarikan.tanggal, nasabah.no_tabungan, admin.nama, penarikan.total_penarikan, penarikan.image_bukti')
        ->join('nasabah','penarikan.nasabah_id=nasabah.id')
        ->join('admin','penarikan.admin_id=admin.id')
        ->orderBy('penarikan.tanggal','DESC')
        ->paginate($num);

SELECT `penarikan`.`id`, `penarikan`.`tanggal`, `nasabah`.`no_tabungan`, `admin`.`nama`, `penarikan`.`total_penarikan`
FROM `penarikan`
JOIN `nasabah` ON `penarikan`.`nasabah_id`=`nasabah`.`id`
JOIN `admin` ON `penarikan`.`admin_id`=`admin`.`id`
WHERE `penarikan`.`nasabah_id` = '4'
ORDER BY `tanggal` DESC
---
    function getDataById($id){
        $builder = $this->table('penarikan');


        $data = $builder->where('penarikan.nasabah_id',$id)
        ->select('penarikan.id, penarikan.tanggal, nasabah.no_tabungan, admin.nama, penarikan.total_penarikan')
        ->join('nasabah','penarikan.nasabah_id=nasabah.id')
        ->join('admin','penarikan.admin_id=admin.id')
        ->orderBy('tanggal','DESC')
        ->findAll();