app/Models/M_produk.php

SELECT `produk`.`id`, `daftar_produk`.`id` AS `daftar_produk_id`, `produk`.`tanggal_update`, `daftar_produk`.`jenis_produk`, `produk`.`stok`, `daftar_produk`.`harga`, `produk`.`total_penjualan`, `produk`.`nominal_penjualan`
FROM `produk`
JOIN `daftar_produk` ON `produk`.`daftar_produk_id`=`daftar_produk`.`id`
WHERE `produk`.`id` = '4'
---
    function getById($id){
        $builder = $this->table('produk');


        $data = $builder->select('produk.id, daftar_produk.id AS daftar_produk_id, produk.tanggal_update, daftar_produk.jenis_produk, produk.stok, daftar_produk.harga , produk.total_penjualan , produk.nominal_penjualan')
        ->join('daftar_produk','produk.daftar_produk_id=daftar_produk.id')
        ->find($id);