app/Models/M_riwayat_transaksi.php

    function addRiwayat($jenis,$tanggal,$jumlah,$admin){
        $builder = $this->table('riwayat_Transaksi');

        $builder->insert([
            'tanggal' => $tanggal,
            'jenis_transaksi' => $jenis,
            'jumlah' => $jumlah,
            'admin_id' => $admin,
        ]);
---
INSERT INTO `riwayat_transaksi` (`tanggal`, `jenis_transaksi`, `jumlah`, `admin_id`) VALUES ('2024/03/03', 'Setoran', 12000, '3')

    function getRiwayatByDate(){
        $builder = $this->table('riwayat_Transaksi');


        $years = [];
        $lastYear = '';
        $setoranChart = [];
        $penarikanChart = [];
        $limbahChart = [];

        $chartData = $builder->select('YEAR(tanggal) AS year, MONTH(tanggal) AS month, COUNT(id) AS total, jenis_transaksi AS jenis')
        ->groupBy('YEAR(tanggal), MONTH(tanggal), jenis_transaksi')->findAll();
---
SELECT YEAR(tanggal) AS year, MONTH(tanggal) AS month, COUNT(id) AS total, `jenis_transaksi` AS `jenis`
FROM `riwayat_transaksi`
GROUP BY YEAR(tanggal), MONTH(tanggal), `jenis_transaksi`