app/Models/M_sampah_masuk.php

    function getTimbulan(){
        $builder = $this->table('sampah_masuk');

        $data = $builder->findAll();
---
SELECT SUM(total_berat) as total_timbulan
FROM `sampah_masuk`
SELECT *
FROM `sampah_masuk`