app/Models/M_sampah_terkelola.php

    function getTotalTerkelola(){
        $builder = $this->table('sampah_terkelola');

        $data = $builder->select('SUM(total_berat) as total_terkelola')->findAll();
---
SELECT SUM(total_berat) as total_terkelola
FROM `sampah_terkelola`