app/Models/M_sampah_tidak_terkelola.php

SELECT SUM(total_berat) as total_tidak_terkelola
FROM `sampah_tidak_terkelola`
---
    function getTotalTidakTerkelola(){
        $builder = $this->table('sampah_tidak_terkelola');

        $data = $builder->select('SUM(total_berat) as total_tidak_terkelola')->findAll();