app/Models/M_setoran.php

    function getPaginated($num,$keyword = null,$startDate=null,$endDate=null){
        $builder = $this->table('setoran');


        if($keyword != ''){
            $builder->like('nasabah.no_tabungan',$keyword)->orLike('sampah.jenis',$keyword);
        }

        if ($startDate != "" && $endDate != ""){
            $builder->where('setoran.tanggal >=', $startDate)->where('setoran.tanggal <=', $endDate);
        }

        $data = $builder->select('setoran.id, setoran.tanggal, nasabah.no_tabungan, admin.nama, sampah.jenis, sampah.satuan , setoran.total_berat , setoran.total_harga , setoran.image_bukti')
        ->join('sampah','setoran.sampah_id=sampah.id')
        ->join('nasabah','setoran.nasabah_id=nasabah.id')
        ->join('admin','setoran.admin_id=admin.id')
        ->orderBy('setoran.tanggal','DESC')
        ->paginate($num);
---
SELECT COUNT(*) AS `numrows`
FROM `setoran`
JOIN `sampah` ON `setoran`.`sampah_id`=`sampah`.`id`
JOIN `nasabah` ON `setoran`.`nasabah_id`=`nasabah`.`id`
JOIN `admin` ON `setoran`.`admin_id`=`admin`.`id`
SELECT `setoran`.`id`, `setoran`.`tanggal`, `nasabah`.`no_tabungan`, `admin`.`nama`, `sampah`.`jenis`, `sampah`.`satuan`, `setoran`.`total_berat`, `setoran`.`total_harga`, `setoran`.`image_bukti`
FROM `setoran`
JOIN `sampah` ON `setoran`.`sampah_id`=`sampah`.`id`
JOIN `nasabah` ON `setoran`.`nasabah_id`=`nasabah`.`id`
JOIN `admin` ON `setoran`.`admin_id`=`admin`.`id`
ORDER BY `setoran`.`tanggal` DESC
 LIMIT 80, 10

    function getDataById($id){
        $builder = $this->table('setoran');

        $data = $builder->where('setoran.nasabah_id',$id)
        ->select('setoran.id, nasabah.no_tabungan, admin.nama, sampah.jenis AS jenis, sampah.satuan , SUM(setoran.total_berat) AS total_berat , SUM(setoran.total_harga) AS total_harga')
        ->join('sampah','setoran.sampah_id=sampah.id')
        ->join('nasabah','setoran.nasabah_id=nasabah.id')
        ->join('admin','setoran.admin_id=admin.id')
        ->groupBy('sampah.jenis')
        ->findAll();
---
SELECT `setoran`.`id`, `nasabah`.`no_tabungan`, `admin`.`nama`, `sampah`.`jenis` AS `jenis`, `sampah`.`satuan`, SUM(setoran.total_berat) AS total_berat, SUM(setoran.total_harga) AS total_harga
FROM `setoran`
JOIN `sampah` ON `setoran`.`sampah_id`=`sampah`.`id`
JOIN `nasabah` ON `setoran`.`nasabah_id`=`nasabah`.`id`
JOIN `admin` ON `setoran`.`admin_id`=`admin`.`id`
WHERE `setoran`.`nasabah_id` = '4'
GROUP BY `sampah`.`jenis`