app/Models/M_tabungan.php

SELECT COUNT(*) AS `numrows`
FROM `tabungan`
JOIN `nasabah` ON `tabungan`.`nasabah_id`=`nasabah`.`id`
SELECT `tabungan`.`id`, `nasabah`.`no_tabungan`, `nasabah`.`nama`, `tabungan`.`saldo`, `tabungan`.`kredit`, `tabungan`.`debit`
FROM `tabungan`
JOIN `nasabah` ON `tabungan`.`nasabah_id`=`nasabah`.`id`
 LIMIT 20, 10
---
    function getPaginated($num,$keyword = null){
        $builder = $this->table('tabungan');

        if($keyword != ''){
            $builder->like('nasabah.no_tabungan',$keyword)->orLike('nasabah.nama',$keyword);
        }

        $data = $builder->select('tabungan.id, nasabah.no_tabungan, nasabah.nama , tabungan.saldo , tabungan.kredit, tabungan.debit')
        ->join('nasabah','tabungan.nasabah_id=nasabah.id')
        ->paginate($num);

SELECT `tabungan`.`id`, `nasabah`.`no_tabungan`, `nasabah`.`nama`, `tabungan`.`saldo`, `tabungan`.`kredit`
FROM `tabungan`
JOIN `nasabah` ON `tabungan`.`nasabah_id`=`nasabah`.`id`
WHERE `no_tabungan` = '4'
---
    function searchById($id){
        $builder = $this->table('tabungan');
        return $builder->where('no_tabungan', $id)
        ->select('tabungan.id, nasabah.no_tabungan, nasabah.nama , tabungan.saldo , tabungan.kredit')
        ->join('nasabah','tabungan.nasabah_id=nasabah.id')->findAll();

SELECT *
FROM `tabungan`
WHERE `nasabah_id` = '4'
---
    function getSaldo($id){
        $builder = $this->table('tabungan');
        $temp = $builder->where('nasabah_id', $id)->findAll();

SELECT SUM(tabungan.saldo) AS saldo
FROM `tabungan`
JOIN `nasabah` ON `tabungan`.`nasabah_id`=`nasabah`.`id`
---
    function getTotalSaldo(){
        $builder = $this->table('tabungan');

        $data = $builder->select('SUM(tabungan.saldo) AS saldo')
        ->join('nasabah','tabungan.nasabah_id=nasabah.id')
        ->findAll();

SELECT SUM(tabungan.kredit) AS kredit
FROM `tabungan`
JOIN `nasabah` ON `tabungan`.`nasabah_id`=`nasabah`.`id`
---
    function getTotalKredit(){
        $builder = $this->table('tabungan');

        $data = $builder->select('SUM(tabungan.kredit) AS kredit')
        ->join('nasabah','tabungan.nasabah_id=nasabah.id')
        ->findAll();

SELECT SUM(tabungan.debit) AS debit
FROM `tabungan`
JOIN `nasabah` ON `tabungan`.`nasabah_id`=`nasabah`.`id`
---
    function getTotalDebit(){
        $builder = $this->table('tabungan');

        $data = $builder->select('SUM(tabungan.debit) AS debit')
        ->join('nasabah','tabungan.nasabah_id=nasabah.id')
        ->findAll();